---
kind: method
id: M:Autodesk.Revit.DB.ComponentRepeaterIterator.Reset
source: html/2b0c8596-2839-5a17-1b75-67c56ed95778.htm
---
# Autodesk.Revit.DB.ComponentRepeaterIterator.Reset Method

Resets the iterator to the initial state.

## Syntax (C#)
```csharp
public virtual void Reset()
```